openfoam_cases/common/system/columnAverage
// -*- C++ -*-

type            columnAverage;
libs            (fieldFunctionObjects);

patches         ( left );
fields          ( UPrime2Mean UMean );

executeControl  onEnd;
writeControl    onEnd;


// ************************************************************************* //
